const facultyInfo = {
  first_course: {
    autumn: {
      semester: 1,
      subjects: [
        {
          name: "Компьютерная математика I (гр. 3)",
          teacher: "Щеглова"
        },
        {
          name: "Компьютерная математика I (гр. 5)",
          teacher: "Щеглова"
        },
        {
          name: "Введение в специальность I",
          teacher: "Малевич"
        },
        {
          name: "Вычислительная практика I",
          teacher: "Щеглова"
        },
      ]
    },
    spring: {
      semester: 2,
      subjects: [
        {
          name: "Компьютерная математика II (гр. 1,6)",
          teacher: "Щеглова"
        },
        {
          name: "Компьютерная математика II (гр. 3)",
          teacher: "Кушнеров"
        },
        {
          name: "Компьютерная математика II (гр. 5)",
          teacher: "Лаврова"
        },
        {
          name: "Введение в специальность II",
          teacher: "Атрохов"
        },
        {
          name: "Вычислительная практика II",
          teacher: "Атрохов"
        },
      ]
    }
  },
  second_course: {
    autumn: {
      semester: 3,
      subjects: [
        {
          name: "Компьютерная математика III",
          teacher: "Голубева"
        },
        {
          name: "Прикладной системный анализ I",
          teacher: "Атрохов"
        },
        {
          name: "Базы данных I",
          teacher: "Кушнеров"
        },
        {
          name: "Вычислительная практика III",
          teacher: "Чергинец"
        },
      ]
    },
    spring: {
      semester: 4,
      subjects: [
        {
          name: "Компьютерная математика IV",
          teacher: "Голубева"
        },
        {
          name: "Прикладной системный анализ II",
          teacher: "Голубева"
        },
        {
          name: "Прикладной системный анализ III",
          teacher: "Атрохов"
        },
        {
          name: "Мат. основы защиты информации I",
          teacher: "Чергинец"
        },
        {
          name: "Нейронные сети и генетические алгоритмы I",
          teacher: "Малевич"
        },
        {
          name: "Базы данных II",
          teacher: "Кушнеров"
        },
        {
          name: "Вычислительная практика IV",
          teacher: "Чергинец"
        },
        {
          name: "Курсовая работа",
          teacher: ""
        },
      ]
    }
  },
  third_course: {
    autumn: {
      semester: 5,
      subjects: [
        {
          name: "Прикладной системный анализ IV",
          teacher: "Тишуров"
        },
        {
          name: "Мат. основы защиты информации II",
          teacher: "Чергинец"
        },
        {
          name: "Нейронные сети и генетические алгоритмы II",
          teacher: "Голубева"
        },
        {
          name: "Мат. основы комп. графики (по выбору)",
          teacher: "Щеглова"
        },
        {
          name: "Параллельные вычисления и алгоритмы (по выбору)",
          teacher: "Лаврова"
        },
      ]
    },
    spring: {
      semester: 6,
      subjects: [
        {
          name: "Прикладной системный анализ V",
          teacher: "Перез Чернов"
        },
        {
          name: "Мат. моделирование динамических процессов I",
          teacher: "Лаврова"
        },
        {
          name: "Компьютерное зрение (по выбору)",
          teacher: "Воробьев"
        },
        {
          name: "Основы линейного программирования (по выбору)",
          teacher: "Лаврова"
        },
        {
          name: "Курсовая работа",
          teacher: ""
        },
        {
          name: "Производственная практика",
          teacher: ""
        },
      ]
    }
  },
  fourth_course: {
    autumn: {
      semester: 7,
      subjects: [
        {
          name: "Мат. моделирование динамических процессов II",
          teacher: "Громак"
        },
        {
          name: "Вейвлет-анализ",
          teacher: "Малевич"
        },
        {
          name: "Прикладной системный анализ I",
          teacher: "Атрохов"
        },
        {
          name: "Теория помехоустойчивого кодирования (по выбору)",
          teacher: "Липницкий"
        },
        {
          name: "Метод конечных элементов (по выбору)",
          teacher: "Лаврова"
        },
      ]
    },
    spring: {
      semester: 8,
      subjects: [
        {
          name: "Преддипломная практика",
          teacher: ""
        },
        {
          name: "Дипломная работа",
          teacher: ""
        },
      ]
    }
  },
  first_mag_course: {
    autumn: {
      semester: 9,
      subjects: [
        {
          name: "Анализ и проектирование бизнес-процессов",
          teacher: "Атрохов"
        },
        {
          name: "Избранные главы теории дифференциальных уравнений",
          teacher: "Громак"
        },
        {
          name: "Мат. основы машинного обучения",
          teacher: "Кушнеров"
        },
        {
          name: "Архитектура распределенных систем",
          teacher: "Лапуцкий"
        },
      ]
    },
    spring: {
      semester: 10,
      subjects: [
        {
          name: "Современные алгоритмы в теории информации",
          teacher: "Липницкий"
        },
        {
          name: "Моделирование и оптимизация",
          teacher: "Чергинец"
        },
        {
          name: "Магистерская диссертация",
          teacher: ""
        },
      ]
    }
  },
  second_mag_course: {
    autumn: {
      semester: 11,
      subjects: [
        {
          name: "Машинное обучение",
          teacher: "Голубева"
        },
        {
          name: "Системная динамика и агентное моделирование",
          teacher: "Лаврова"
        },
        {
          name: "Эволюционные алгоритмы",
          teacher: "Василевич"
        },
        {
          name: "Практическая криптография",
          teacher: "Чергинец"
        },
        {
          name: "Дифференциальные уравнения в приложениях",
          teacher: "Амелькин"
        },
        {
          name: "Производственная практика",
          teacher: ""
        },
      ]
    },
    spring: {
      semester: 12,
      subjects: [
        {
          name: "Магистерская диссертация",
          teacher: ""
        },
      ]
    }
  },
}

export default facultyInfo;